update notes
